import type { ClassNameType } from "./photo";

export const species: Species[] = [
    "Берёза повислая",
    "Боярышник однопестичный",
    "Вишня обыкновенная",
    "Вяз гладкий",
    "Другой",
    "Дуб красный",
    "Дуб черешчатый",
    "Дёрен пестролистный",
    "Ель европейская",
    "Ива плакучая",
    "Каштан конский",
    "Кизильник блестящий",
    "Клён платановидный",
    "Клён явор",
    "Липа крупнолистная",
    "Липа мелколистная",
    "Липа сердцевидная",
    "Осина",
    "Рябина обыкновенная",
    "Сирень обыкновенная",
    "Сосна",
    "Спирея",
    "Тополь",
    "Тополь белый",
    "Черёмуха обыкновенная",
    "Чубушник венечный",
    "Яблоня садовая",
    "Ясень обыкновенный",
];

export const diases: Diases[] = [
    "Березовый трутовик",
    "Вертициллезное увядание",
    "Голландская болезнь вяза",
    "Другое",
    "Естественное отмирание ветвей",
    "Здоров",
    "Комплексное усыхание",
    "Корневая губка",
    "Корневая или комлевая гниль",
    "Механическое повреждение ствола",
    "Мучнистая роса",
    "Рак",
    "Ржавчина",
    "Стволовая гниль",
    "Фитофтороз",
    "Халаровый некроз",
    "Ядровая гниль вызванная дереворазрушающими грибами",
];

export type Species =
    | "Берёза повислая"
    | "Боярышник однопестичный"
    | "Вишня обыкновенная"
    | "Вяз гладкий"
    | "Другой"
    | "Дуб красный"
    | "Дуб черешчатый"
    | "Дёрен пестролистный"
    | "Ель европейская"
    | "Ива плакучая"
    | "Каштан конский"
    | "Кизильник блестящий"
    | "Клён платановидный"
    | "Клён явор"
    | "Липа крупнолистная"
    | "Липа мелколистная"
    | "Липа сердцевидная"
    | "Осина"
    | "Рябина обыкновенная"
    | "Сирень обыкновенная"
    | "Сосна"
    | "Спирея"
    | "Тополь"
    | "Тополь белый"
    | "Черёмуха обыкновенная"
    | "Чубушник венечный"
    | "Яблоня садовая"
    | "Ясень обыкновенный";

export type Diases =
    | "Березовый трутовик"
    | "Вертициллезное увядание"
    | "Голландская болезнь вяза"
    | "Другое"
    | "Естественное отмирание ветвей"
    | "Здоров"
    | "Комплексное усыхание"
    | "Корневая губка"
    | "Корневая или комлевая гниль"
    | "Механическое повреждение ствола"
    | "Мучнистая роса"
    | "Рак"
    | "Ржавчина"
    | "Стволовая гниль"
    | "Фитофтороз"
    | "Халаровый некроз"
    | "Ядровая гниль вызванная дереворазрушающими грибами";

export interface DatasetRaw {
    name: string;
    description?: string;
}

export interface Dataset extends DatasetRaw {
    id: number;
    created_at: string;
}

export interface AttachPhotoToDataset {
    dataset_id: number;
    photo_id: number;
}

export interface DatasetWithPhotos extends Dataset {
    photo_ids: number[];
}

export interface AnnotationRaw {
    bbox: [number, number, number, number];
    className: ClassNameType;
    species: Species;
    diseases: Diases;
    hollows: number;
    cracks: number;
    stemDamage: number;
    crownDamage: number;
    fruitingBodies: number;
    dryBranches: number;
}
